In [1]:
import pandas as pd

In [23]:
df=pd.read_csv('income.csv')

In [24]:
df

    Name      Income
0    Rob      5000.0
1  Rafic      6000.0
2   Nana      4000.0
3  Sofia         NaN
4  Mohan      8000.0
5    Tac      7000.0
6   Elon  10000000.0

In [4]:
df.describe()

             Income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [5]:
df.Income.quantile(1)

10000000.0

In [7]:
df.Income.quantile(0.25)

5500.0

In [8]:
df.Income.quantile(0.99)

9400479.999999994

In [9]:
df[df.Income.quantile(0.99)>]

SyntaxError: invalid syntax (2227088699.py, line 1)

In [11]:
percent=df.Income.quantile(0.99)
percent

9400479.999999994

In [12]:
df[df.Income>percent]

   Name    Income
6  Elon  10000000

In [13]:
newdata=df[df.Income<percent]

In [14]:
newdata

    Name  Income
0    Rob    5000
1  Rafic    6000
2   Nana    4000
3  Sofia    7500
4  Mohan    8000
5    Tac    7000

In [15]:
df.Income.median()

7000.0

In [16]:
df

    Name    Income
0    Rob      5000
1  Rafic      6000
2   Nana      4000
3  Sofia      7500
4  Mohan      8000
5    Tac      7000
6   Elon  10000000

In [17]:
df.Income.mean()

1433928.5714285714

In [20]:
import numpy as np
df['Income']['3']=np.NaN
df

C:\Users\USER\AppData\Local\Temp\ipykernel_23820\2574156638.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Income']['3']=np.NaN

    Name    Income
0    Rob      5000
1  Rafic      6000
2   Nana      4000
3  Sofia      7500
4  Mohan      8000
5    Tac      7000
6   Elon  10000000

In [21]:
df

    Name    Income
0    Rob      5000
1  Rafic      6000
2   Nana      4000
3  Sofia      7500
4  Mohan      8000
5    Tac      7000
6   Elon  10000000

In [22]:
df

    Name    Income
0    Rob      5000
1  Rafic      6000
2   Nana      4000
3  Sofia      7500
4  Mohan      8000
5    Tac      7000
6   Elon  10000000

In [25]:
df

    Name      Income
0    Rob      5000.0
1  Rafic      6000.0
2   Nana      4000.0
3  Sofia         NaN
4  Mohan      8000.0
5    Tac      7000.0
6   Elon  10000000.0

In [26]:
df.fillna(df.Income.mean())

    Name        Income
0    Rob  5.000000e+03
1  Rafic  6.000000e+03
2   Nana  4.000000e+03
3  Sofia  1.671667e+06
4  Mohan  8.000000e+03
5    Tac  7.000000e+03
6   Elon  1.000000e+07

In [27]:
df.fillna(df.Income.median())

    Name      Income
0    Rob      5000.0
1  Rafic      6000.0
2   Nana      4000.0
3  Sofia      6500.0
4  Mohan      8000.0
5    Tac      7000.0
6   Elon  10000000.0